{"config": [{"config": {"input_dtype": "float32", "name": "input", "batch_input_shape": [null, 80, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u0000`@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>'\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "function_type": "lambda", "output_shape_type": "raw", "trainable": true}, "class_name": "Lambda"}, {"config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s,\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S)\u0003N\u00e9\n\u0000\u0000\u0000i\u00f6\u00ff\u00ff\u00ff\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>*\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "function_type": "lambda", "output_shape_type": "raw", "trainable": true}, "class_name": "Lambda"}, {"config": {"bias": true, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform", "nb_row": 5, "W_regularizer": null, "nb_col": 5, "name": "convolution2d_1", "W_constraint": null, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "nb_filter": 24, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform", "nb_row": 5, "W_regularizer": null, "nb_col": 5, "name": "convolution2d_2", "W_constraint": null, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "nb_filter": 36, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform", "nb_row": 5, "W_regularizer": null, "nb_col": 5, "name": "convolution2d_3", "W_constraint": null, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "nb_filter": 48, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "nb_row": 3, "W_regularizer": null, "nb_col": 3, "name": "convolution2d_4", "W_constraint": null, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "nb_row": 3, "W_regularizer": null, "nb_col": 3, "name": "convolution2d_5", "W_constraint": null, "border_mode": "same", "b_constraint": null, "b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"p": 0.5, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias": true, "init": "glorot_uniform", "input_dim": 128, "W_regularizer": null, "output_dim": 128, "name": "dense_1", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias": true, "init": "glorot_uniform", "input_dim": 128, "W_regularizer": null, "output_dim": 64, "name": "dense_2", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias": true, "init": "glorot_uniform", "input_dim": 64, "W_regularizer": null, "output_dim": 1, "name": "output", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}