{"config": [{"config": {"output_shape": null, "input_dtype": "float32", "batch_input_shape": [null, 80, 160, 3], "name": "input", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00fe\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "arguments": {}, "output_shape_type": "raw", "trainable": true}, "class_name": "Lambda"}, {"config": {"nb_filter": 24, "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "nb_col": 5, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 5, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_filter": 36, "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "nb_col": 5, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 5, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_filter": 48, "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "nb_col": 5, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 5, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_filter": 64, "name": "convolution2d_4", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "nb_col": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 3, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"nb_filter": 64, "name": "convolution2d_5", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "activation": "linear", "nb_col": 3, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "bias": true, "nb_row": 3, "border_mode": "same", "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 128, "name": "dense_1", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 12800, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 64, "name": "dense_2", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 128, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 16, "name": "dense_3", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "relu", "input_dim": 64, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"output_dim": 1, "name": "output", "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 16, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}