{"keras_version": "1.2.0", "config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00fe\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 80, 160, 3], "trainable": true, "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "output_shape": null, "name": "input", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"border_mode": "same", "activity_regularizer": null, "bias": true, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 24, "W_regularizer": null, "W_constraint": null, "trainable": true, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_1", "b_regularizer": null, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "same", "activity_regularizer": null, "bias": true, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 36, "W_regularizer": null, "W_constraint": null, "trainable": true, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_2", "b_regularizer": null, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "same", "activity_regularizer": null, "bias": true, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 48, "W_regularizer": null, "W_constraint": null, "trainable": true, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_3", "b_regularizer": null, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "same", "activity_regularizer": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "trainable": true, "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_4", "b_regularizer": null, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "same", "activity_regularizer": null, "bias": true, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "trainable": true, "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_5", "b_regularizer": null, "dim_ordering": "tf", "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "input_dim": 12800, "bias": true, "output_dim": 128, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_1", "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 128, "bias": true, "output_dim": 64, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_2", "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 64, "bias": true, "output_dim": 16, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "name": "dense_3", "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 16, "bias": true, "output_dim": 1, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "name": "output", "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}