{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"name": "input", "input_dtype": "float32", "trainable": true, "output_shape": null, "arguments": {}, "output_shape_type": "raw", "function_type": "lambda", "batch_input_shape": [null, 80, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00fe\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_1", "bias": true, "activity_regularizer": null, "trainable": true, "nb_filter": 24, "subsample": [2, 2], "border_mode": "same", "W_regularizer": null, "b_constraint": null, "nb_row": 5}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_2", "bias": true, "activity_regularizer": null, "trainable": true, "nb_filter": 36, "subsample": [2, 2], "border_mode": "same", "W_regularizer": null, "b_constraint": null, "nb_row": 5}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "name": "convolution2d_3", "bias": true, "activity_regularizer": null, "trainable": true, "nb_filter": 48, "subsample": [2, 2], "border_mode": "same", "W_regularizer": null, "b_constraint": null, "nb_row": 5}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_4", "bias": true, "activity_regularizer": null, "trainable": true, "nb_filter": 64, "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "b_constraint": null, "nb_row": 3}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_5", "bias": true, "activity_regularizer": null, "trainable": true, "nb_filter": 64, "subsample": [1, 1], "border_mode": "same", "W_regularizer": null, "b_constraint": null, "nb_row": 3}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "output_dim": 128, "activation": "relu", "W_constraint": null, "batch_input_shape": [null, 12800], "init": "glorot_uniform", "name": "dense_1", "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": 12800, "b_constraint": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "output_dim": 64, "activation": "relu", "W_constraint": null, "batch_input_shape": [null, 128], "init": "glorot_uniform", "name": "dense_2", "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": 128, "b_constraint": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "output_dim": 16, "activation": "relu", "W_constraint": null, "batch_input_shape": [null, 64], "init": "glorot_uniform", "name": "dense_3", "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": 64, "b_constraint": null, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "output_dim": 1, "activation": "linear", "W_constraint": null, "batch_input_shape": [null, 16], "init": "glorot_uniform", "name": "output", "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": 16, "b_constraint": null, "W_regularizer": null, "b_regularizer": null}}]}